[
    "What is your student ID?",
    "What is your gender?",
    "How old are you?",
    "What is your nationality?",
    "Which department are you in?",
    "What semester are you currently in?",
    "Which courses have you taken?",
    "What grades did you get in your courses?",
    "What is your course attendance record?",
    "Have you passed or failed any courses?",
    "What is your major?",
    "Did you change your major at any point?",
    "What is your CGPA?",
    "How long did it take you to complete your degree?",
    "Have you completed your degree (Yes/No)?",
    "Which subjects are you good at?",
    "Do you plan to move to a foreign country?",
    "Do you like coding?",
    "Do you plan to pursue further studies after your Bachelor's degree?",
    "Are you satisfied with your Bachelor's degree?",
    "Are you able to solve hard problems?",
    "Do you enjoy working on software projects?",
    "Do you have experience with software development?",
    "Do you have any internships or work experience?",
    "Do you enjoy working in teams?",
    "Do you prefer working alone?",
    "Do you have any experience with web development?",
    "Do you have any experience with mobile app development?",
    "Do you have any experience with database management?",
    "Do you have any experience with artificial intelligence?",
    "Do you have any experience with machine learning?",
    "Do you enjoy learning new programming languages?",
    "Do you have any experience with cloud computing?",
    "Do you have any experience with cybersecurity?",
    "Do you have any experience with data analysis?",
    "Do you have any experience with network management?",
    "Do you have any experience with software testing?",
    "Do you have any experience with project management?",
    "Do you have any experience with game development?",
    "Do you have any experience with user interface design?",
    "Do you have any experience with user experience design?",
    "Do you have any experience with system administration?",
    "Do you enjoy solving complex problems?",
    "Do you have any experience with embedded systems?",
    "Do you have any experience with IoT (Internet of Things)?",
    "Do you have any experience with blockchain technology?",
    "Do you have any experience with virtual reality?",
    "Do you have any experience with augmented reality?",
    "Do you have any experience with software architecture?",
    "Do you have any experience with software engineering methodologies?"
]  