[
    "How do you identify your gender?",
    "What age are you, and how does it influence your perspective?",
    "Which country do you hail from, and what do you cherish most about it?",
    "What major are you passionate about in your Intermediate studies?",
    "Can you describe your overall experience in your Intermediate studies?",
    "Which courses have you enjoyed the most and why?",
    "Have you completed your degree? If so, what are your future plans?",
    "Do you find joy in coding and programming?",
    "How do you feel about mathematics?",
    "What excites you about Physics?",
    "What interests you about chemistry?",
    "Do you thrive on solving challenging problems?",
    "Which subjects spark your curiosity and interest?",
    "What courses do you find the most engaging?",
    "Which courses do you find the most challenging?",
    "Do you consider yourself more introverted or extroverted?",
    "Do you rely more on sensing or intuition in your daily life?",
    "Are you guided more by thinking or feeling in your decisions?",
    "Do you prefer a structured approach or a more flexible, open-ended one?",
    "Do you enjoy hands-on lab work and experiments?",
    "Do you find theoretical studies fascinating?",
    "Do you enjoy collaborating with others in team settings?",
    "Do you prefer working independently and setting your own pace?",
    "Do you love tackling problem-solving activities?",
    "Do you have a keen interest in computer science?",
    "Are you excited about learning new technologies?",
    "Do you have a knack for analytical thinking?",
    "Do you enjoy designing and creating innovative things?",
    "Are you intrigued by electronics and how they work?",
    "Do you find it easy to understand and explain complex concepts?",
    "Do you enjoy conducting experiments and discovering new things?",
    "Do you have a passion for working with numbers and equations?",
    "Are you enthusiastic about learning new programming languages?",
    "Do you excel at logical reasoning and problem-solving?",
    "Have you explored robotics and its applications?",
    "Do you enjoy participating in science fairs or competitions?",
    "Do you thrive on working on diverse projects?",
    "Are you interested in the field of engineering?",
    "Do you find scientific concepts easy to grasp and apply?",
    "Do you love solving mathematics puzzles and brainteasers?",
    "Do you have a preference for a specific science subject?",
    "Are you fascinated by the universe and space exploration?",
    "Do you consider yourself to have strong problem-solving skills?",
    "Do you enjoy reading science-related articles and books?",
    "Do you like taking things apart to understand how they work?",
    "Do you have a passion for innovation and new ideas?",
    "Do you enjoy working on collaborative group projects?",
    "Do you find it easy to follow logical sequences and processes?",
    "Are you interested in pursuing a career in science or engineering?"
]