[
    "What's your age and how do you feel about being this age?",
    "Which country do you come from and what do you love most about it?",
    "What department are you passionate about and why?",
    "What semester are you currently exploring?",
    "What courses have you enjoyed the most and why?",
    "How do you keep track of your course attendance?",
    "Have you encountered any courses that challenged you significantly?",
    "What is your major, and how did you choose it?",
    "Did you ever consider changing your major? If so, why?",
    "What is your CGPA, if you're comfortable sharing it, or how do you feel about your academic performance overall?",
    "How long did it take you to complete your degree, and what did you learn from the journey?",
    "Have you completed your degree? If so, what's next for you?",
    "Which subjects ignite your curiosity and passion?",
    "Are you planning to move to a foreign country, and what excites you about that prospect?",
    "Do you find joy in coding? If yes, what do you enjoy most about it?",
    "Are you considering further studies after your Bachelor's degree? What would you like to explore?",
    "How do you feel about your Bachelor's degree experience?",
    "Do you enjoy tackling challenging problems? Can you share an example?",
    "What aspects of software projects do you enjoy working on the most?",
    "Do you have a passion for software development? What projects have you worked on?",
    "Have you had any internships or work experience that shaped your career interests?",
    "Do you thrive in team environments? What do you enjoy about teamwork?",
    "Do you prefer working independently? Why?",
    "Have you explored web development? What do you find fascinating about it?",
    "Have you tried mobile app development? What projects have you worked on?",
    "Do you have an interest in database management? What aspects do you find engaging?",
    "Are you intrigued by artificial intelligence? What excites you about it?",
    "Have you delved into machine learning? What projects have you undertaken?",
    "Do you enjoy learning new programming languages? Which ones have you learned?",
    "Have you explored cloud computing? What do you find innovative about it?",
    "Do you have an interest in cybersecurity? What aspects captivate you?",
    "Have you worked with data analysis? What insights have you discovered?",
    "Do you have experience with network management? What challenges have you faced?",
    "Have you been involved in software testing? What do you enjoy about it?",
    "Do you have a knack for project management? What projects have you led?",
    "Have you ventured into game development? What games have you created?",
    "Do you enjoy designing user interfaces? What do you find fulfilling about it?",
    "Are you passionate about user experience design? What projects have you worked on?",
    "Do you have experience with system administration? What have you learned from it?",
    "Do you find solving complex problems exciting? Can you share an example?",
    "Have you explored embedded systems? What projects have you worked on?",
    "Are you interested in IoT (Internet of Things)? What innovations have you explored?",
    "Have you delved into blockchain technology? What aspects do you find revolutionary?",
    "Have you experimented with virtual reality? What experiences have you created?",
    "Are you fascinated by augmented reality? What projects have you undertaken?",
    "Do you have experience with software architecture? What systems have you designed?",
    "Are you familiar with software engineering methodologies? Which ones do you prefer?"
]
